{
  "type": "libraries",
  "id": "Current_Monitor",
  "links": {
    "download": "https://api.particle.io/v1/libraries/Current_Monitor/archive/0.0.5.tar.gz"
  },
  "attributes": {
    "name": "Current_Monitor",
    "version": "0.0.5",
    "installs": 1290,
    "license": "GNU",
    "author": "Travis Elliott <travis@controlanything.com>",
    "sentence": "Library intended for the operation of ControlEverything Current Monitoring products compatible with Particle Interface modules.",
    "url": "https://github.com/controleverythingcom/current_monitor",
    "repository": "https://github.com/controleverythingcom/current_monitor.git",
    "architectures": [],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "c",
  "cardUrl": "/cards/libraries/c/Current_Monitor",
  "versions": {
    "0.0.5": {
      "builds": {
        "2.0.1": {
          "photon": {
            "1-Channel-Event-Trip": true,
            "Current-Limit-Breaker": false
          },
          "electron": {
            "1-Channel-Event-Trip": true,
            "Current-Limit-Breaker": false
          },
          "argon": {
            "1-Channel-Event-Trip": false,
            "Current-Limit-Breaker": false
          },
          "boron": {
            "1-Channel-Event-Trip": false,
            "Current-Limit-Breaker": false
          }
        },
        "1.5.2": {
          "photon": {
            "1-Channel-Event-Trip": true,
            "Current-Limit-Breaker": false
          },
          "electron": {
            "1-Channel-Event-Trip": true,
            "Current-Limit-Breaker": false
          },
          "argon": {
            "1-Channel-Event-Trip": false,
            "Current-Limit-Breaker": false
          },
          "boron": {
            "1-Channel-Event-Trip": false,
            "Current-Limit-Breaker": false
          }
        }
      }
    }
  },
  "readme": "# About\n\nThis Library is intended for use with ControlEverything Current Monitoring products on the Particle Core/Photon/Electron platform.\n\nThe intention of this library is to make use of the ControlEverything Current Monitor Products with Particle development web IDE as simple as possible for users.\n\nCurrent Monitoring products from ControlEverything may be purchased [here] [currentmonitorcategory].\n\n###Developer information\nNCD has been designing and manufacturing computer control products since 1995.  We specialize in hardware design and manufacturing of sensory input and output control devices.  We pride ourselves as being the industry leader of computer control relay products as well as sensory reading products.  Our products are proven reliable and we are very excited to support Particle.  For more information on NCD please visit www.controleverything.com\n\n###Requirements\n- [Particle Compatible Current Monitor][sht30store].\n- Particle Core, Photon, or Electron module\n- Knowledge base for developing and programming with Particle Core/PhotonElectron modules.\n\n### Version\n1.0.0\n\n### How to use this library\n\nThe libary must be imported into your application.  This can be done through the Particle WEB IDE by searching community Libraries on Particle's WEB IDE(Build) for Current_Monitor.  Click Include in App button.  Select the App you want to include the library in.  Finally click Add to this app.  For more information see [Particle's documentation] [sparkIncludeLibrary].\nYou can also use the example applications from the library by making sure the example ino file you want to use is selected, then click on the Use This Example button.\n\n### Example use\n\nOnce the Library is included in your applicaiton you should see an include statement at the top like this:\n```cpp\n//This #include statement was automatically added by the Particle IDE.\n#include \"Current_Monitor/Current_Monitor.h\"\n```\n\nNow you need to instanciate an object of the library for use in your application like this:\n```cpp\nCurrentMonitor current;\n```\n\nHere is an example use case for the class:\n```cpp\n// This #include statement was automatically added by the Particle IDE.\n#include \"Current_Monitor/Current_Monitor.h\"\n\nCurrentMonitor current;\ndouble current;\n\nvoid setup() {\nif(!current.initialize(0,0,0,0)){\nSerial.println(\"Initialize failed\");\n}\nParticle.variable(\"Current\", current);\n}\n\nvoid loop() {\nif(current.deviceStatusReady){\ndouble c = current.readChannelCurrent(1);\nif(c != current.failedCommand){\ncurrent = c;\n}\n}\ndelay(1000);\n}\n```\n\n###Public accessible methods\n```cpp\nbool CurrentMonitor::initialize(int a0, int a1, int a2, int a3);\n```\n>Must be called first before using the object.  This method should also be called any time communication with\n>the controller is lost or broken to recover communication  This method accepts four int argument.  This\n>tells the Library what address to direct commands to.  a0, a1, a2, and a3 re representations of the the Address\n>jumpers on the Current Monitor board.  If the jumper is\n>installed then send a 1, if the jumper is not installed send a 0 like this ```current.initialize(0,0,0,0);```\nThis function will return true if the device responds or false if it does not.\n\n\n```cpp\nint readChannelCurrentMa(int channel);\n```\n>This method accepts 1 int argument specifying the channel to be read.  This method will return the current reading on that channel in milliamps.\n>\n\n```cpp\ndouble readChannelCurrent(int channel);\n```\n>This method accepts 1 int argument specifying the channel to be read.  This method will return the current reading on that channel in amps as a double variable.\n>\n\n```cpp\nbool readAllChannelsMa(int *buffer);\n```\n>This method accepts 1 int pointer argument which should be an int array the size of the number of channels on the board.  This method will read the current of all channels on the board in milliamps and will populate those readings in the int array.  The function will return true if the process completes successfully or false if something goes wrong.\n>\n\n```cpp\nbool readAllChannels(double *buffer);\n```\n>This method accepts 1 double pointer argument which should be a double array the size of the number of channels on the board.  This method will read the current of all channels on the board in amps and will populate those readings in the double array.  The function will return true if the process completes successfully or false if something goes wrong.\n>\n\n```cpp\nbool readCalibration(int startChannel, int stopChannel, int *buffer);\n```\n>This method accepts 2 int arguments and 1 int pointer argument.  This method will read the calibration settings out of the board for multiple channls.  The startChannel argument specifies the first channel calibration to be read.  The stopChannel argument specifies the last channel calibration to be read.  The int pointer should be an int array the same size as the number of channels to be read.  The method will populate the int array with the calibration readings for the specified channels.  If the user wishes to read channels 1, 2, 3, and 4 then they should pass 1 as the startChannel, 4 as the stopChannel, and they should pass a pointer to an int array with a size of 4.  The function will return true if the process completes successfully or false if something goes wrong.\n>\n>A function will be added in the future to alter calibration values.\n\n###Public accessible Variables\n\n```cpp\nbool deviceStatusReady\n```\n>This boolean variable will indicate the device's status as either ready or not ready.  This variable should be checked before sending any command to the library.\n\n```cpp\nbyte sensorType\n```\n>This variable indicates the type of sensor used on the controller.\n\n```cpp\nbyte maxCurrent\n```\n>This variable indicates the maximum current which can be read on each channel of the controller.\n\n```cpp\nbyte numberOfChannels\n```\n>This variable indicates the number of channels on the controller.\n\n```cpp\nbyte firmwareVersion\n```\n>This variable indicates the version of firmware installed on the controller's CPU.  Note that this has nothing to do with the firmware running on the Particle Module.\n\n```cpp\nint failedCommand = 2147483646;\n```\n>This variable variable is used as the return if a function which is to return an int variable fails.\n\nLicense\n----\n\nGNU\n[sparkIncludeLibrary]:https://docs.particle.io/guide/getting-started/build/photon/\n[currentmonitorcategory]:https://www.controleverything.com/products?f[0]=field_assigned_categories%3A6172&f[1]=field_assigned_categories%3A6223",
  "allVersions": [
    "0.0.5",
    "0.0.4",
    "0.0.3",
    "0.0.2"
  ]
}