{
  "type": "libraries",
  "id": "DFPlayer",
  "links": {
    "download": "https://api.particle.io/v1/libraries/DFPlayer/archive/0.0.1.tar.gz"
  },
  "attributes": {
    "name": "DFPlayer",
    "version": "0.0.1",
    "installs": 4130,
    "license": "GNU GPLv3",
    "author": "Rodney Palmer",
    "maintainer": "RodneyPalmer (rwpalmeribm@gmail.com)",
    "sentence": "Submits commands to, and processes commands from, the DFPlayer (FN-M16P) MP3/WAV player.",
    "category": "Other",
    "url": "",
    "repository": "",
    "architectures": [
      "particle-photon"
    ],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "d",
  "cardUrl": "/cards/libraries/d/DFPlayer",
  "versions": {
    "0.0.1": {
      "builds": {
        "2.0.1": {
          "photon": {},
          "electron": {},
          "argon": {},
          "boron": {}
        }
      },
      "noExamples": true,
      "added": "2022-06-17T10:16:53.840Z"
    }
  },
  "readme": "# DFPlayer\r\n\r\n## This library was developed for testing the capabilities of the DFPlayer (FN-M16P)\r\n\r\nWhen I first heard about the DFPlayer, it sounded like it was just what I needed to build my next project. That project was going to be a Photon that could sound chimes and alarms based on events that other Photon projects have detected ... for example:\r\n\r\n*\tSound a string of chimes when a garage door opens.\r\n*\tSound a string of beeps if a garage door is open for more than 3 minutes between 8PM and 6AM\r\n*\tSound a bong when the power company cuts power to our boiler, and sound chirping birds when the power is restored.\r\n\r\nThe new project would be placed in a central portion of the house, so the sound could be heard everywhere.\r\n\r\nTesting proved that the DFPlayer was suitable for this purpose, but also revealed that the player has its share of warts. Most of these stem from poor documentation and an incohesive command structure.\r\n\r\n\r\n\r\nOne of the first things I learned while testing was that the serial connection to the DFPlayer carried was not as simple as I expected.\r\n\r\n*\tWe send commands to the player\r\n*\tThe player responds to those commands\r\n*\tThe player also sends unsolicited messages ...\r\n\t*\tan initialization message when the device boots or resets\r\n\t*\tan \"I'm playing\" message every second while playing a track\r\n\r\nI decided to build a library to help make sense of the traffic and the command structure. That library is still evolving, but I decided to release it ASIS in case it helps others in their testing ... Perhaps we can work together to make sense of this player.\r\n\r\n\r\n",
  "allVersions": [
    "0.0.1"
  ]
}