{
  "type": "libraries",
  "id": "DFPlay",
  "links": {
    "download": "https://api.particle.io/v1/libraries/DFPlay/archive/0.0.9.tar.gz"
  },
  "attributes": {
    "name": "DFPlay",
    "version": "0.0.9",
    "installs": 1212,
    "license": "GNU GPLv3",
    "author": "Rodney Palmer",
    "maintainer": "RodneyPalmer (rwpalmeribm@gmail.com)",
    "sentence": "Enhanced Library for the DFPlayer, which masks the complexity of native DFPlayer commands with methods that mirror the buttons on a portable MP3 player.",
    "category": "Other",
    "url": "",
    "repository": "https://github.com/rwpalmer/DFPlay",
    "architectures": [
      "particle-photon"
    ],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "d",
  "cardUrl": "/cards/libraries/d/DFPlay",
  "versions": {
    "0.0.9": {
      "builds": {},
      "noExamples": true,
      "added": "2022-06-17T10:16:53.936Z"
    }
  },
  "readme": "\r\n\r\n\r\n\r\n# ***DFPlay***\r\n ***An Enhanced Library for the DFPlayer***\r\n\r\n## *Overview*\r\nDFPlayers are inexpensive and they have a serial interface. This makes them a useful resource for IOT projects.\r\n\r\nWhile it is true that the DFPlayer can be used without a library, it is also true that a library can make the DFPlayer much easier to use. This library's methods mirror the buttons that you would find on a portable MP3 player.  Methods like\"play()\", \"stop()\", \"pause()\", \"resume()\", and \"skip()\"  control the DFPlayer and mask the complexity of DFPlayer's native command set.  DFPlay also provides enhanced functionality. For example: \r\n* DFPlay plays all content with one ***play(*** Selection ***)*** command, where \"Selection\":\r\n\t*  defines the content to be played\r\n\t* allows the volume setting to be adjusted for the duration of content play.  This addresses a common audio playback problem, where some content plays louder than other content. It also makes it simple to play some content (say an alarm) louder than other content.\r\n\t* allows the equalizer setting to be adjusted for the duration of content play\r\n\t* enables the use of playlists (demonstrated in the library's playList.ino example). \r\n\r\n* New mute() and unmute() functionality was added.\r\n* New softStop() functionality tells DFPlayer to stop playing when the current track ends.\r\n* Developers have Instant access to DFPlayer state information with methods like:  *isPlaying()*, *isPaused()*, *isIdle()*, *isMuted()*.\r\n* Low-power \"sleep\" mode is automatically enabled after the device has been idle for 2 seconds, and seamlessly disabled when the next play()* method is called.\r\n\r\nSo DFPlay offers ease-of-use and enhanced functionality. In the following \"Architecture\" section, you will see how it can manage the DFPlayer with minimal impact on system resources. \r\n\r\nThe final point in this \"overview\" is to mention that there are times when a library can not or should not be used. DFPlay's QuickStart Guide, PlaySolution.ino example, and LOGGING functions  were developed with the hope that they can assist those who use the library and those who are simply looking for to build their understanding of the DFPlayer and its native command set.  \r\n\r\n## *Architecture*\r\nAs you can see in the following drawing, DFPlay has one method named **manageDevice()** that handles ALL communication with the DFPlayer device. Every other DFPlay method simply updates and/or returns \"state variables\" that reside in memory. These methods complete their assigned tasks and return instantly. \r\n\r\n![alt text](https://github.com/rwpalmer/DFPlay/blob/master/images/DFPlayArchitecture.png)\r\n\r\n\r\nEach time manageDevice() is called, it asks two simple questions: \r\n1. Have I received any data from the DFPlayer?\r\n2. Do I need to send a command to the DFPlayer?\r\n\r\nThe vast majority of the time (over 99.9% in testing), both answers are no, and manageDevice() simply exits. \r\n\r\nWhen the answer to the first question is yes, manageDevice() updates state variables based on the data it received from the DFPlayer. \r\n\r\nWhen the answer to the second question is yes, manageDevice() will perform the following tasks:\r\n\r\n 1. exit immediately if it is too soon to send another command to the DFPlayer.\r\n 2. evaluate state variables based on a set of rules which compare current and desired states to search for non-compliance.\r\n 3. send a command to the DFPlayer to correct the first non-compliance found.\r\n 4. exit immediately after the command is sent. \r\n \r\nIf another non-compliance issues exists, each  will be corrected in a subsequent manageDevice() execution cycle. \r\n\r\nDFPlayer needs time to process each command it receives. Most commands complete within 30ms, but some take longer. When manageDevice() sends a command, it calculates when it will be safe to send the next command. That calculation is the basis for step 1 exiting in the above task list. \r\n\r\nDFPlay's design allows it to manage the DFPlayer with minimal impact to the host application, and gives developers the option of letting manageDevice() run in loop() or triggering it with a timer that can be started and stopped based on the applications need for the DFPlayer.  \r\n\r\n## *Usage Information*\r\nThe DFPlay QuickStart Guide provides more detailed information about DFPlay commands, and the Selection object that is used to identify the content to be played on the DFPlayer:     [******DFPlay QuickStart*** Guide***](https://docs.google.com/document/d/e/2PACX-1vTxUyPOpk9RFMaxt53oPotWyAa5pTBVzpSS2L23bq2fGhUXK08vAFPSAWQ6gENLNFoum10IWmVFkJ7I/pub)\r\n \r\nThe DFPlay library is published with five sample applications.  All require a \r\nDFPlayer (like the FN-M16P / DFPlayer-Mini) wired to a Particle device and a speaker or earphones. Details are provided\r\n\r\n#### PlaySD.ino and PlaySD-timer.ino\r\nInsert any SD media that contains .mp3 or .wav files into the DFPlayer, flash the Particle device, and  listen to the music ... or whatever. \r\n[documentation](https://github.com/rwpalmer/DFPlay/blob/master/doc/PlaySD.md)\r\n\r\n#### PlaySelection.ino\r\nUse DFPlay library methods to control your DFPlayer ... without any coding. This example allows you to select media content and execute DFPlay methods via two Particle functions. \r\n[documentation](https://github.com/rwpalmer/DFPlay/blob/master/doc/PlaySolution.md)\r\n\r\n#### PlayList.ino\r\nCreate a \"playlist\" and listen to your DFPlayer play it ... without any coding.  This example allows you to select media content and add it to a playlist. The playlist automatically starts playing when the first selection is added. Add as many selections as you like. \r\n[documentation](https://github.com/rwpalmer/DFPlay/blob/master/doc/PlayList.md)\r\n\r\n#### DoorAlarm.ino\r\nMonitor a virtual door. This example Plays one track when the door closes, and another track when the door opens, and replays it every five minutes while the door remains open. Door status is toggled via a Particle function.\r\n\r\nIn this case, the selected tracks are hard-coded, so you will need to modify the track selections to conform with your media.\r\n[documentation](https://github.com/rwpalmer/DFPlay/blob/master/doc/DoorAlarm.md)\r\n\r\n## *Project Status*\r\n* Release Candidate 1 is posted\r\n* Planned release in September 2018\r\n* Please feel free to explore, comment, experiment, test ... whatever. Please post any issues to GitHub.  The author will also field any questions you may have. \r\n\r\n> Written with [StackEdit](https://stackedit.io/).\r\n",
  "allVersions": [
    "0.0.9",
    "0.0.8"
  ]
}