{
  "type": "libraries",
  "id": "DGS",
  "links": {
    "download": "https://api.particle.io/v1/libraries/DGS/archive/2.0.1.tar.gz"
  },
  "attributes": {
    "name": "DGS",
    "version": "2.0.1",
    "installs": 657,
    "author": "DPeaslee",
    "maintainer": "DPeaslee <davidpeaslee23@gmail.com>",
    "sentence": "Enables DGS set up and control. DGS is digital sensor SDK platform. For Firmware 25SEP17.",
    "paragraph": "from KWJ Engineering with SPEC Sensor sensor.",
    "category": "Sensors",
    "url": "http://www.spec-sensors.com",
    "architectures": [
      "avr",
      " sam",
      " particle-photon",
      " particle-electron"
    ],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "d",
  "cardUrl": "/cards/libraries/d/DGS",
  "versions": {
    "2.0.1": {
      "builds": {},
      "noExamples": true,
      "added": "2022-06-17T10:16:54.023Z"
    }
  },
  "readme": "= DULP Library for Arduino =\r\n\r\nCreated by David E. Peaslee, March 29, 2018.\r\nCreated for SPEC/KWJ Digital Gas Sensor (DGS, or also known as DULPSM)\r\n\r\nThis is the library for the SPEC Sensors Digital Gas Sensor (DGS), also known as DGSDK, or previously DULP.\r\nThis library has no expressed guarantee or warranty and is free to use or distribute.\r\nThis version was created March 31st, 2018, with previous version in 2016. \r\nThis library was created by David Peaslee, with much help from the interweb. \r\n\r\nDGS Sensor Library - Example use of library for reading KWJ Engineering digital potentiostat with SPEC Sensors on Digital SDK.\r\n\r\n\r\n!!! RX, TX Must be on 3.3 volt communication, or using level shifters to get to 3.3V UART!!!\r\n\r\nWiring:\r\nConnect the TX of Digital Sensor to the RX of 3.3 V Arduino\r\nConnect the RX of Digital Sensor to the TX of 3.3 V Arduino\r\nConnect the power of Digital Sensor to the 3.3V power of the Arduino\r\nConnect the ground of Digital Sensor to the ground of the Arduino\r\n\r\nThis code is optimized for the Arduino Due, but can be modified to work with any other Arduino.\r\nThe DGS is a 3.3V device, which means you must use level shifters if using with a 5V Arduino.\r\n\r\nSoftwareSerial is needed for any Arduino compatible device that does not have a native alternative serial port (Serial1).  DGS runs at 9600 baud rate.\r\n\r\n\r\nThese examples require the DGS libraries (EXCEPT for DSDK_UART), if it does not compile look to the library.properties file and add your board to the architectures.\r\nThe purpose of this example is to help you set up the DGS. After the first setup, loading the barcode into the DGS, you do not need to repeat the setup portion of the DGS commands. You only need to initialize the serial ports in Setup.\r\n\r\nIn DSDK_SETUP you can re-zero at anytime by sending Z through the serial terminal, once the continuous output starts. If you require technical assistance, please grab a screen shot of the BarCode text, as well as the output of the EEPROM, and the Firmware Date. To turn off verbose setup, change DEBUG to false.\r\n\r\nDSDK_Photon is for the particle photon microcontroller, but works with similar code to DSDK_SETUP.\r\n\r\nDSDK_RUN2 will work if your board is capable of supporting 2 UART devices at the same time. Arduino Due is an excelent chouce for this example.\r\n\r\nDSDK_Photon tested on Phonton.\r\nDSDK_RUN2 tested using Serial1 and Serial2 of Arduino Due.\r\nDSDK_SETUP tested on Due, and 3.3V Arduino Pro Mini (using softwareSerial, instead of Serial1).\r\nDSDK_UART tested on Due, Photon, and 3.3V Arduino Pro Mini (using softwareSerial, instead of Serial1).\r\n",
  "allVersions": [
    "2.0.1",
    "2.0.0"
  ]
}