{
  "type": "libraries",
  "id": "FTPFileSender",
  "links": {
    "download": "https://api.particle.io/v1/libraries/FTPFileSender/archive/0.1.6.tar.gz"
  },
  "attributes": {
    "name": "FTPFileSender",
    "version": "0.1.6",
    "installs": 447,
    "license": "ISC",
    "author": "wvdv2002",
    "sentence": "Send compressed and get uncompressed files over FTP to/from a server.",
    "paragraph": "This library can be used to send and get files over FTP to a server. It uses the compressFile library to make the files smaller.",
    "url": "https://github.com/wvdv2002/Particle-FTPFileSender",
    "repository": "https://github.com/wvdv2002/Particle-FTPFileSender.git",
    "architectures": [],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "f",
  "cardUrl": "/cards/libraries/f/FTPFileSender",
  "versions": {
    "0.1.6": {
      "builds": {},
      "noExamples": true
    }
  },
  "readme": "# FTPFileSender\n\nA Particle library, FTPFileSender, to send compressed and receive uncompressed files over FTP to/from a ftp server.\nUsing this library you can call a function on a particle device and the Particle will compress and then send a file to the designated FTP server.\n\n## Getting started\nAdd some files to an SDcard and connect this SDcard to your Particle device. \nSetup the right pins and SD card configuration in the example.\nSet the ip address, username and password of the server in the FTPFileSender constructor.\nRun the example by compiling and flashing the files to a particle device.\n\nSetup a server that works as required by the [particleftpclient](https://github.com/jychuah/ParticleFtpClient) library. \nI use ProFTPD as the ftp server.\n\nSee the [examples](examples) folder for more details.\n\nWhen running the example, you can run particle call \"name\" sendFile \"/path/to/file\" to send a file.\nRun  particle call \"name\" status to get the status of the file sending.\n\n## Documentation\nAfter sending a file, it can be decompressed as described in the [compressFile](https://github.com/wvdv2002/Particle-compressFile) library. \n\n### Setting up a server tips:\nIn my work environment the Electrons are all in a seperate network with a VPN connection with the server. \nThe server has a set IP Address, some DNS lookup might be necessary if your server has no set IP address.\nThere might be some challenges in setting up a safe passive FTP server without a seperate VPN.\nif using proFTPD make sure to at least set some limits in the config file and don't forget to open some passive ports as well as the main ftp port.\nI added a user particle-ftp that can only access the folder /particle-ftp on the server. It cannot start a terminal session, only upload files over FTP.\nIn the [linux](examples/linux) folder in examples is an example script on how to unheatshrink a file automatically after receiving it.\n\n\n## Contributing\n* There is no option to send files uncompressed for now. This might be a useful addition.\n* There is no option to download files from the same ftp server.\n* A nice update would be to let the user instantiate the particleftpclient and add a reference in the ftpfilesender constructor, so the ftp client can be used for more things than only file sending.\n* Another nice update would be to be able to upload a file with the complete file structure on the sd card.\n\n## LICENSE\nCopyright 2017 wvdv2002\n\nLicensed under the ISC license\n",
  "allVersions": [
    "0.1.6",
    "0.1.3",
    "0.1.2",
    "0.1.1"
  ]
}