{
  "type": "libraries",
  "id": "G35",
  "links": {
    "download": "https://api.particle.io/v1/libraries/G35/archive/1.0.0.tar.gz"
  },
  "attributes": {
    "name": "G35",
    "version": "1.0.0",
    "license": "BSD",
    "author": "Mike Tsao <sowbug@sowbug.com>",
    "sentence": "This library makes it easy to replace the controller in GE Color Effects Christmas lights with an Arduino.",
    "url": "https://github.com/guppy/g35",
    "repository": "https://github.com/guppy/g35.git",
    "architectures": [],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "g",
  "cardUrl": "/reference/device-os/libraries/g/G35",
  "versions": {
    "1.0.0": {
      "builds": {},
      "noExamples": true,
      "added": "2026-02-02T09:49:30.553Z"
    }
  },
  "readme": "Introduction\n============\n\nG-35 Lights, Green (image removed) Read [the blog post](http://www.deepdarc.com/2010/11/27/hacking-christmas-lights/)\nthat started it all.\n\nThis library makes it easy to replace the controller in GE Color Effects Christmas lights with an Arduino, and to run much better light programs. If you can program C or Processing, it's pretty easy to make new programs, too!\n\nSee a [demo](http://www.youtube.com/watch?v=QyKt7tHV-EM). There is also a [not-awful professional demo](http://www.geholidaylighting.com/holiday-lighting/led/color-effects) of the original, unmodified hardware.\n\nFeatures\n========\n\n- With your Arduino, Teensy, or pile of laundry lint that happens to\n  contain an Atmel AVR ATmega, G35Arduino becomes a\n  splice-in replacement for the stock G35 controller. Contains versions\n  of the same programs that ship with the lights. Your spouse won't know\n  the difference!\n\n- Also contains custom programs: Inchworm, Orbit, Cylon, Meteorite,\n  just to name a few! Your spouse will know the difference!\n\n- Easy to add your own programs. If you can make it through the Arduino\n  Blink tutorial, you can probably write your own light program!\n\n- Synchronizes multiple strings. Have them each run individual instances\n  of the same light program. Have them each run different programs, but\n  with synchronized program changes. Or combine as many strings as you\n  want into a single mondo gigantic virtual string! (Number of physical\n  strings is limited by the number of output pins on your\n  microcontroller, as well as the memory requirements of the running\n  light programs.)\n\n- Express your individualism! G35Arduino operates completely\n  independently of [requests from Twitter](http://www.cheerlights.com/), Facebook, SMS, XBee, neighbors,\n  and drive-thru spectators. You bought 'em, you should get to control\n  what they do!\n\nRequirements\n============\n\n- [Arduino 1.0 SDK](http://arduino.cc/en/Main/Software). This code is not compatible with pre-1.0 Arduino.\n\n- Any of the following: an Arduino or Arduino-compatible, a [Teensy](http://www.pjrc.com/) with Teensyduino or else flashed with an Arduino Leonardo bootloader. Also a plain Atmel ATmega of some sort, if you know what you're doing.\n\n- At least one working strand of GE G-35 Color Effects Christmas lights that you are willing to slice up and solder back together again.\n\nInstallation\n============\n\n1. Find your Arduino IDE's sketches directory.\n\n1. If there isn't already one, create a `libraries` directory inside the sketches directory.\n\n1. Unzip the project archive into `libraries`. It should end up looking like this: `[Your Arduino sketches directory]/libraries/G35Arduino/G35.h (etc.)`\n\n1. Restart your Arduino IDE and you should see G35Arduino among the libraries.\n\n1. Upload the BasicExample sketch to your Arduino. You should see the pin-13 LED flicker as the sketch tries to send data to your lights.\n\n1. Chop off the stock controller on your lights, being careful to note the function of the three leads from the first light (from left to right looking at the first light pointing upward, they're V+, DATA, and GND).\n\n1.  Put V+ on the Arduino 5V pin, GND on the GND pin, and DATA on pin 13, and your lights should come back to life!\n\nI've been happily running two strands on my house directly off the\nArduino (i.e., not using the stock power transformer) with an old USB\npower supply rated 5V/1A from a Kodak Zi8. Your mileage may vary.\n\nContributing\n============\n\nSource-code contributions are welcome. If you think you might contribute\nimprovements back to the project, git clone into libraries/ instead of\nunzipping, and to avoid going insane, check the \"external editor\" option\nin the Arduino IDE and use a text editor directly on the library source.\n\nWe try to follow Google's C++ coding standards: 2 spaces, no tabs, 80\ncolumns, and follow the existing naming/capitalization conventions in the\ncode.\n\nFurther Reading\n-\n\n- There's a fork of this project that I've heard puts my programs to\n  shame. [Check it out](https://github.com/MarkEMarkEMark/G35-MEO-Programs).\n\n- Want to hack on the original G35 remote with your Arduino? [There's a\n  library for that](https://lukecyca.com/2013/g35-rf-remote.html).\n\nCredits\n=======\n\n- [Paul Martis](http://www.digitalmisery.com)\n\n- [Robert Quattlebaum](http://www.deepdarc.com/2010/11/27/hacking-christmas-lights)\n\n- [Scott Harris](http://scottrharris.blogspot.com/2010/12/controlling-ge-color-effects-lights.html)\n\n- [Mark Ortiz](https://github.com/MarkEMarkEMark), with some of Mark's code inspired by [Adafruit](http://adafruit.com/)\n\n- [Mike Tsao](http://github.com/sowbug)\n",
  "allVersions": [
    "1.0.0"
  ]
}