{
  "type": "libraries",
  "id": "PulseSensor_Spark",
  "links": {
    "download": "https://api.particle.io/v1/libraries/PulseSensor_Spark/archive/1.5.4.tar.gz"
  },
  "attributes": {
    "name": "PulseSensor_Spark",
    "version": "1.5.4",
    "installs": 13368,
    "license": "CreativeCommons",
    "author": "Joel Murphy, Yury Gitman, ported by Paul Kourany",
    "sentence": "PulseSensor Amped library v1.4 for Particle devices",
    "url": "https://github.com/pkourany/PulseSensor_Spark",
    "repository": "https://github.com/pkourany/PulseSensor_Spark.git",
    "architectures": [],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "p",
  "cardUrl": "/cards/libraries/p/PulseSensor_Spark",
  "versions": {
    "1.5.4": {
      "builds": {
        "2.0.1": {
          "photon": {
            "PulseSensorAmped_Arduino_1dot4": false
          },
          "electron": {
            "PulseSensorAmped_Arduino_1dot4": false
          },
          "argon": {
            "PulseSensorAmped_Arduino_1dot4": false
          },
          "boron": {
            "PulseSensorAmped_Arduino_1dot4": false
          }
        }
      }
    }
  },
  "readme": "PulseSensor Library adapted for Spark Core by Paul Kourany, June 2015 from:\n\n# Pulse Sensor Amped 1.4\n\n## Works with Particle Core, Photon and Electron !!!\n\n## Update Jan 16/2018\nFixed conflict with `Signal` variable and Particle firmware definition of the same name.  Also removed SparkIntervalTimer library dependency in properties file so user can attach the latest Build (IDE) version.\n\n## Update Oct 24/2016\nRemoved the outdated SparkIntervalTimer library code so user can attach the latest Build (IDE) version.\n\n*In order for this app to compile correctly, the following Partible Build (Web IDE) library MUST be attched:*\n* SparkIntervalTimer\n\n---\n\nThis code is for Pulse Sensor Amped by Joel Murphy and Yury Gitman\n    www.pulsesensor.com \n\t\n    Pulse Sensor purple wire goes to Analog Pin A2 (see PulseSensor_Spark.h for details)\n\t\nPulse Sensor sample aquisition and processing happens in the background via a hardware Timer interrupt. 2mS sample rate.\nPWM on selectable pins A0 and A1 will not work when using this code, because the first allocated timer is TIMR2!\nThe following variables are automatically updated:\nrawSignal : int that holds the analog signal data straight from the sensor. updated every 2mS.\nIBI  :      int that holds the time interval between beats. 2mS resolution.\nBPM  :      int that holds the heart rate value, derived every beat, from averaging previous 10 IBI values.\nQS  :       boolean that is made true whenever Pulse is found and BPM is updated. User must reset.\nPulse :     boolean that is true when a heartbeat is sensed then false in time with pin13 LED going out.\n\nThis code is designed with output serial data to Processing sketch \"PulseSensorAmped_Processing-xx\"\nThe Processing sketch is a simple data visualizer. \nAll the work to find the heartbeat and determine the heartrate happens in the code below.\nPin D7 LED (onboard LED) will blink with heartbeat.\nIf you want to use pin D7 for something else, specifiy different pin in Interrupt.h\nIt will also fade an LED on pin fadePin with every beat. Put an LED and series resistor from fadePin to GND.\nCheck here for detailed code walkthrough:\nhttp://pulsesensor.myshopify.com/pages/pulse-sensor-amped-arduino-v1dot1\n\nNew to v1.5 (Sept 2015)\n\nWorks with Paritcle Core and Photon!\n\nNew to v1.4\n-------\n\nASCII Serial Monitor Visuals - See the User's Pulse & BPM via the Serial port.\nOpen a serial monitor for this ASCII visualization.\n\nTo Turn On ASCII Visualizer:\n\n```// Regards Serial OutPut  -- Set This Up to your needs\nstatic boolean serialVisual = false;   // Set to 'false' by Default. \n```\n\nto:\n\n```// Regards Serial OutPut  -- Set This Up to your needs\nstatic boolean serialVisual = true;   // Re-set to 'true' to do ASCII Visual Pulse  : ) \n```\n\nThat's it's! Upload and open your Serial Monitor.\n\nPulse Sensor Amped 1.4    by Joel Murphy and Yury Gitman   http://www.pulsesensor.com\n",
  "allVersions": [
    "1.5.4",
    "1.5.3",
    "1.5.2",
    "1.5.1",
    "1.5.0",
    "1.4.0",
    "1.2.1",
    "1.2.0"
  ]
}