{
  "type": "libraries",
  "id": "Thermistor",
  "links": {
    "download": "https://api.particle.io/v1/libraries/Thermistor/archive/0.0.1.tar.gz"
  },
  "attributes": {
    "name": "Thermistor",
    "version": "0.0.1",
    "installs": 704,
    "license": "none",
    "author": "Bruce Calder <brucebcalder@gmail.com>",
    "sentence": "A thermistor library",
    "url": "https://github.com/bruster999/thermistor",
    "repository": "https://github.com/bruster999/thermistor.git",
    "architectures": [],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "t",
  "cardUrl": "/cards/libraries/t/Thermistor",
  "versions": {
    "0.0.1": {
      "builds": {
        "2.0.1": {
          "photon": {
            "spark_deck_lights": false
          },
          "electron": {
            "spark_deck_lights": false
          },
          "argon": {
            "spark_deck_lights": false
          },
          "boron": {
            "spark_deck_lights": false
          }
        }
      }
    }
  },
  "readme": "These code samples, in Arduino, Processing, and PHP, are for my book \"Making Things Talk\", second edition. Note that the Arduino examples are all written for the current experimental build of Arduino, so will not work in versions 22 or earlier.\n\nThe book itself is copyrighted material, published under a Creative Commons CC-NC-ND license. As for the code:\n\nThis code is here to help you make things. In general, you may use this code in your programs and documentation. You do not need to contact me for permission unless you’re reproducing a significant portion of the code. For example, writing a program that uses several chunks of code from this repository does not require permission. Selling or distributing a CD-ROM of examples from this repository does require permission. Answering a question by citing this material and quoting example code does not require permission. Incorporating a significant amount of example code from this repository into your product’s documentation does require permission.\n\nI appreciate, but do not require, attribution. An attribution usually includes the title, author, and source URL.\n\nIf you feel your use of code examples falls outside fair use or the permission given here, feel free to contact me.\n\n-Tom Igoe"
}