{
  "type": "libraries",
  "id": "WS2801",
  "links": {
    "download": "https://api.particle.io/v1/libraries/WS2801/archive/1.0.0.tar.gz"
  },
  "attributes": {
    "name": "WS2801",
    "version": "1.0.0",
    "installs": 4077,
    "license": "MIT",
    "author": "Will Dages",
    "sentence": "Spark Library for WS2801 LEDs (Ported from Adafruit's WS2801 Arduino Library by Technobly / BDub, put into this repo in the Spark Library format by Will Dages",
    "url": "https://github.com/willdages/ws2801",
    "repository": "https://github.com/willdages/ws2801.git",
    "architectures": [],
    "visibility": "public",
    "mine": false
  },
  "kind": "community library",
  "letter": "w",
  "cardUrl": "/cards/libraries/w/WS2801",
  "versions": {
    "1.0.0": {
      "builds": {
        "2.0.1": {
          "photon": {
            "app": false
          },
          "electron": {
            "app": false
          },
          "argon": {
            "app": false
          },
          "boron": {
            "app": false
          }
        },
        "1.5.2": {
          "photon": {
            "app": false
          },
          "electron": {
            "app": false
          },
          "argon": {
            "app": false
          },
          "boron": {
            "app": false
          }
        }
      }
    }
  },
  "readme": "WS2801\n======\n\nA WS2801 Library for the Spark Core (Originally written by Adafruit). The name is 'WS2801' instead of 'Adafruit_WS2801' because 'Adafruit_WS2801' is already taken by another user who has not published the library.\n\n## History\n\nThis library originated from Adafruit as a [WS2801 Arduino Library](https://github.com/adafruit/Adafruit-WS2801-Library) with a BSD license. It was then ported over to the Spark Core by \"Technobly / Bdub\" according to the note at the top of the library. The original version may be here [in this gist](https://gist.github.com/technobly/8339548) but it wasn't the version I started with. I took [this version](https://github.com/kwyjibo089/SparkWeatherMoodlight/blob/master/Arduino/moodlight.ino) from Roman Mueller's [Weather Moodlight tutorial](http://blog.roman-mueller.ch/index.php/2014/03/13/a-weather-moodlight/) and split it out into this file structure so it could be included as a library in the Spark IDE.\n\nI wrote very little of this code (barely touched the WS2801.h and WS2801.cpp files), and modified Roman's application to work as a better generic example for the library (mainly this means stripping out a bunch of functions that were too specific).\n\n## License\n\nI'm a little confused actually. The original work created by Adafruit mentions the BSD license in their README, but doesn't include a license file. It does however mention needing to include a block of copy in any redistributions, so I have included those in all 3 code files in `/firmware`. In the WS2801.cpp file, it mentions the MIT license. Per [this article](http://en.wikipedia.org/wiki/BSD_licenses), there are 6 different BSD licenses, so I went with the MIT license for this project because there's only one. If anyone would like to clarify how I should be handling the license for this, I will be receptive and responsive to make appropriate changes.\n",
  "allVersions": [
    "1.0.0"
  ]
}